trade_exp/src/Documents/ПеремещениеТоваров/ПеремещениеТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ПеремещениеТоваров</name>
  <objectBelonging>Adopted</objectBelonging>
  <registerRecords>AccumulationRegister.ТоварыОрганизацийКПередачеПеремещения</registerRecords>
  <registerRecords>AccumulationRegister.ДвижениеМаркированногоТовара</registerRecords>
  <registerRecords>AccumulationRegister.ТоварыКОтгрузкеПоНакладным</registerRecords>
  <attributes>
    <name>ПеремещениеПодДеятельность</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ГлавныйБухгалтер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ПеремещениеПоЗаказам</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СкладОтправитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Руководитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ХозяйственнаяОперация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ОрганизацияПолучатель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ОсобыеУсловияПеревозки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ВремяДоставкиС</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>СкладПолучатель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>АдресДоставкиПеревозчика</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ПеревозчикПартнер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ВидЦены</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Статус</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>АдресДоставки</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ВремяДоставкиПо</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Сделка</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ЗаказНаПеремещение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДополнительнаяИнформацияПоДоставке</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ЗонаДоставки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СпособДоставки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ОсобыеУсловияПеревозкиОписание</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ПодтвержденПодотчетником</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ПеремещениеНаФилиал</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Водитель</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ВариантПриемкиТоваров</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="1bfda24a-d445-4b39-8af4-ed67ca72e740">
    <name>Основание</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="3b5a903f-6f26-4f4d-a0a5-cf413f2243b3">
    <name>УведомлениеПодрядчикуОтправлено</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="1779da3c-c51d-4f88-b689-8e209e99fe68">
    <name>ПрибытиеНаОтгрузку</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="24b1fcdd-19c7-4dc9-b249-704eb17fb2a0">
    <name>ИдентификаторСоздания</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="2ffb7f4e-66c9-48c5-96e0-1baecd646a67">
    <name>НаправлениеДеятельности</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="c4f22582-806d-4de7-8edb-0315fd4de7e8">
    <name>ВидПодтоварки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="dd80c28d-f00c-452e-b502-75210c534406">
    <name>ДатаПоставкиНаСклад</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="6cf61f94-1052-4a7d-8b0c-3ca30671d5b1">
    <name>Автор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="8f8abbfa-b9cf-4125-94d5-4bb7574640ca">
    <name>ДатаПоступления</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="f735e5a6-4870-4db6-896d-baad4431b155">
    <name>ИсключитьИзКонтроля</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="63c178f4-5fe4-4d2f-a3e0-5485d4e0bd64">
    <name>ДатаПринятия</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>СтатусУказанияСерий</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>2</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>ЗаказНаПеремещение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Серия</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Сделка</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>КодСтроки</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>10</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Назначение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Количество</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Кладовщик</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="1c277ba2-83ae-4afd-9219-7d576048dc52">
      <name>КомментарийОтИнженера</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>30</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="91863164-52e3-42fb-98c7-928548d16930">
      <name>Отсканирован</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="b9f39c6a-f3b5-4be2-9fb9-68bbcf37b953">
      <name>СпособВводаКоличества</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Document>

trade_exp/src/Enums/СтатусыПеремещенийТоваров/СтатусыПеремещенийТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>СтатусыПеремещенийТоваров</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues>
    <name>Отгружено</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>Принято</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

trade_exp/src/Documents/БлокировкаДвиженияТоваров/БлокировкаДвиженияТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="ec36221d-37a4-4c12-9c34-7cb1eceaead1">
  <name>БлокировкаДвиженияТоваров</name>
  <objectBelonging>Adopted</objectBelonging>
  <registerRecords>AccumulationRegister.РаспределениеЗапасовДвижения</registerRecords>
  <registerRecords>AccumulationRegister.ЗапасыИПотребности</registerRecords>
  <attributes extendedConfigurationObject="bcd3b202-1b4b-4cb7-9c80-2a93e9f648db">
    <name>ДокументОснование</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="8173986d-73df-48fa-9cc8-38cfe45d8748">
    <name>БлокировкаОснование</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="5f9d0fad-e42e-4731-8107-06e3f90b212d">
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="441ea6d9-ec19-4570-b97b-f8e66ebbde99">
    <name>Статус</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="8671922f-e1fb-486a-bbb5-fd960e199e94">
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="250a0493-3164-44eb-9b46-4baeac4f1c2c">
    <name>ПричинаБлокировки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="c23c42b8-9959-4ace-91a6-5a7cbc2fbb63">
    <name>Ответственный</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="a9f05fa3-fa19-43ed-95dd-01e6677ecdf1">
    <name>Товары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="d8f9f1e5-d2cd-4da7-ad72-aefa73478085">
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="89a7e0a8-ebb3-4118-ac5f-b614e1a2fac3">
      <name>Характеристика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="42ebd587-1a10-4279-b4c1-ce101094cfa4">
      <name>КоличествоУпаковок</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="a7742230-e6be-4988-9a70-2b9318d2e6e8">
      <name>Упаковка</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Document>

trade_exp/src/Documents/ПеремещениеТоваров/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

&После ("ДобавитьКомандыСозданияНаОсновании")
Процедура Док_ДобавитьКомандыСозданияНаОсновании(КомандыСозданияНаОсновании, Параметры) Экспорт
	Если ПравоДоступа("Добавление", Метаданные.Документы.ВозвратТоваровМеждуОрганизациями) Тогда
		КомандаСоздатьНаОсновании = КомандыСозданияНаОсновании.Добавить();
		КомандаСоздатьНаОсновании.Идентификатор = "ПеремещениеТоваров_ВозвратТоваровМеждуОрганизациями";
		КомандаСоздатьНаОсновании.Менеджер = Метаданные.Документы.ВозвратТоваровМеждуОрганизациями.ПолноеИмя();
		КомандаСоздатьНаОсновании.Представление = "Возврат товаров между организациями";
		КомандаСоздатьНаОсновании.РежимЗаписи = "Проводить";
		КомандаСоздатьНаОсновании.Обработчик = "ВводНаОснованииДополнительноКлиент.ВводНаОснованииКлиент";
	КонецЕсли;

	Документы.БлокировкаДвиженияТоваров.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании);

		КомандаСоздатьНаОсновании = КомандыСозданияНаОсновании.Добавить();
		КомандаСоздатьНаОсновании.Идентификатор = "ЗаказНаДоставкуКлиенту";
		КомандаСоздатьНаОсновании.Менеджер = Метаданные.Документы.ЗаказНаДоставкуКлиенту.ПолноеИмя();
		КомандаСоздатьНаОсновании.Представление = "Заказ на доставку";
		КомандаСоздатьНаОсновании.РежимЗаписи = "Проводить";
КонецПроцедуры

Функция ПеремещениеНаФилиал(Документ) экспорт
	если ДопМодуль.ПолучитьНастройкиХранилища("НастройкиПеремещений")=НЕОПРЕДЕЛЕНО или не ДопМодуль.ПолучитьНастройкиХранилища("НастройкиПеремещений").Свойство("ТаблицаНастройки") тогда
		возврат ложь;
	конецесли;	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТаблицаПеремещений.СкладОтправитель КАК СкладОтправитель,
		|	ТаблицаПеремещений.СкладПолучатель КАК СкладПолучатель
		|ПОМЕСТИТЬ ВР_Настройки
		|ИЗ
		|	&ТаблицаПеремещений КАК ТаблицаПеремещений
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВР_Настройки.СкладОтправитель КАК СкладОтправитель
		|ИЗ
		|	ВР_Настройки КАК ВР_Настройки
		|ГДЕ
		|	ВР_Настройки.СкладОтправитель = &СкладОтправитель
		|	И ВР_Настройки.СкладПолучатель = &СкладПолучатель
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВР_Настройки.СкладОтправитель
		|ИЗ
		|	ВР_Настройки КАК ВР_Настройки
		|ГДЕ
		|	ВР_Настройки.СкладПолучатель = &СкладОтправитель
		|	И ВР_Настройки.СкладОтправитель = &СкладПолучатель";
	
	Запрос.УстановитьПараметр("СкладОтправитель", Документ.СкладОтправитель);
	Запрос.УстановитьПараметр("СкладПолучатель", Документ.СкладПолучатель);
	Запрос.УстановитьПараметр("ТаблицаПеремещений", ДопМодуль.ПолучитьНастройкиХранилища("НастройкиПеремещений").ТаблицаНастройки);
	
	Возврат не Запрос.Выполнить().Пустой();
	
КонецФункции // ПеремещениеНаФилиал()

&После("ЗарегистрироватьУчетныеМеханизмы")
Процедура Док_ЗарегистрироватьУчетныеМеханизмы(МеханизмыДокумента)
	МеханизмыДокумента.Добавить("ОтгрузкаПоНакладным");  
	МеханизмыДокумента.Добавить("ДвижениеМаркированногоТовара"); 
КонецПроцедуры

Функция ТекстЗапросаТаблицаКОтгрузкеПоНакладным(Запрос, ТекстыЗапроса, Регистры, Документ) экспорт
	
	ИмяРегистра = "ТоварыКОтгрузкеПоНакладным";
	
	Если НЕ (ПроведениеДокументов.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) И 
		АльтерраОбщегоНазначения.ОтгрузкаПоНакладным(Документ.Дата,Документ.СкладОтправитель)) Тогда
		Возврат "";
	КонецЕсли;
		
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ТаблицаТовары.Ссылка КАК Ссылка,
	|	ВЫБОР
	|		КОГДА НЕ ТаблицаТовары.ЗаказНаПеремещение В (НЕОПРЕДЕЛЕНО, ЗНАЧЕНИЕ(Документ.ЗаказНаПеремещение.ПустаяСсылка))
	|			ТОГДА ТаблицаТовары.ЗаказНаПеремещение
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК Заказ,
	|	ТаблицаТовары.Номенклатура КАК Номенклатура,
	|	ТаблицаТовары.Характеристика КАК Характеристика,
	|	ТаблицаТовары.Количество КАК Количество,
	|	РазмещениеНоменклатурыПоСкладскимЯчейкам.Ячейка.РабочийУчасток КАК РабочийУчасток,
	|   ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаТовары.НазначениеОтправителя.ДвиженияПоСкладскимРегистрам, ЛОЖЬ)
	|			ТОГДА ТаблицаТовары.НазначениеОтправителя
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
	|	КОНЕЦ КАК Назначение
	|ПОМЕСТИТЬ ВтТаблицаТоваров
	|ИЗ
	|	Документ.ПеремещениеТоваров.Товары КАК ТаблицаТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РазмещениеНоменклатурыПоСкладскимЯчейкам КАК РазмещениеНоменклатурыПоСкладскимЯчейкам
	|		ПО ТаблицаТовары.Номенклатура = РазмещениеНоменклатурыПоСкладскимЯчейкам.Номенклатура
	|			И ТаблицаТовары.Ссылка.СкладОтправитель = РазмещениеНоменклатурыПоСкладскимЯчейкам.Склад
	|			И (РазмещениеНоменклатурыПоСкладскимЯчейкам.ОсновнаяЯчейка = ИСТИНА)
	|ГДЕ
	|	ТаблицаТовары.Номенклатура.ТипНоменклатуры В (ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Товар), ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.МногооборотнаяТара))
	|	И ТаблицаТовары.Ссылка В(&Ссылка)
	|	И ТаблицаТовары.Количество <> 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	&Период КАК Период,
	|	ТаблицаТовары.Ссылка.СкладОтправитель КАК Склад,
	|	ТаблицаТовары.РабочийУчасток КАК РабочийУчасток,
	|	ТаблицаТовары.Ссылка.СкладПолучатель КАК Получатель,
	|	ТаблицаТовары.Ссылка КАК Накладная,
	|	ТаблицаТовары.Заказ КАК Заказ,
	|	ТаблицаТовары.Номенклатура КАК Номенклатура,
	|	ТаблицаТовары.Характеристика КАК Характеристика,
	|	ТаблицаТовары.Назначение КАК Назначение,
	|	ТаблицаТовары.Количество КАК КОтгрузке
	|ИЗ
	|	ВтТаблицаТоваров КАК ТаблицаТовары";
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	// -
	
	Возврат ТекстЗапроса;

	
КонецФункции     

Функция ТекстЗапросаТаблицаДвижениеМаркированногоТовара(Запрос, ТекстыЗапроса, Регистры) экспорт
	ИмяРегистра = "ДвижениеМаркированногоТовара";
	
	Если НЕ ПроведениеДокументов.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат "";
	КонецЕсли;
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	Штрихкоды.Ссылка.Дата КАК Период,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	Штрихкоды.Ссылка.СкладПолучатель КАК Склад,
	|	Штрихкоды.Ссылка.Организация КАК Организация,
	|	ШтрихкодыУпаковка.Ссылка КАК ШтрихкодУпаковки,
	|	Штрихкоды.ШтрихкодУпаковки КАК Штрихкод,
	|	1 КАК Количество
	|ИЗ
	|	Документ.ПеремещениеТоваров.ШтрихкодыУпаковок КАК Штрихкоды
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ШтрихкодыУпаковокТоваров.ВложенныеШтрихкоды КАК ШтрихкодыУпаковка
	|		ПО Штрихкоды.ШтрихкодУпаковки = ШтрихкодыУпаковка.Штрихкод
	|ГДЕ
	|	Штрихкоды.Ссылка = &Ссылка
	|   И Штрихкоды.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПеремещенийТоваров.Принято)
	|	И ВЫБОР
	|			КОГДА Штрихкоды.Ссылка.СкладПолучатель.ИспользоватьОрдернуюСхемуПриПоступлении
	|					И Штрихкоды.Ссылка.Дата >= Штрихкоды.Ссылка.СкладПолучатель.ДатаНачалаОрдернойСхемыПриПоступлении
	|				ТОГДА ЛОЖЬ
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Штрихкоды.Ссылка.Дата,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход),
	|	Штрихкоды.Ссылка.СкладОтправитель,
	|	Штрихкоды.Ссылка.Организация,
	|	Штрихкоды.ШтрихкодУпаковки,
	|	ШтрихкодыУпаковка.Ссылка ,
	|	1
	|ИЗ
	|	Документ.ПеремещениеТоваров.ШтрихкодыУпаковок КАК Штрихкоды
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ШтрихкодыУпаковокТоваров.ВложенныеШтрихкоды КАК ШтрихкодыУпаковка
	|		ПО Штрихкоды.ШтрихкодУпаковки = ШтрихкодыУпаковка.Штрихкод
	|ГДЕ
	|	Штрихкоды.Ссылка = &Ссылка    
	|   И Штрихкоды.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПеремещенийТоваров.Принято)
	|	И ВЫБОР
	|			КОГДА Штрихкоды.Ссылка.СкладОтправитель.ИспользоватьОрдернуюСхемуПриОтгрузке
	|					И Штрихкоды.Ссылка.Дата >= Штрихкоды.Ссылка.СкладОтправитель.ДатаНачалаОрдернойСхемыПриОтгрузке
	|				ТОГДА ЛОЖЬ
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ";	
	
  	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	
	Возврат ТекстЗапроса;

КонецФункции

#КонецЕсли
